In [1]:
import pandas as pd

In [2]:
import numpy as np

## String Methods

In [3]:
s='hello WORLD'
print(s.upper())

HELLO WORLD

In [4]:
print(s.lower())

hello world

In [5]:
print(s.swapcase())

HELLO world

In [6]:
p='         hello world'
print(p.strip())

hello world

In [7]:
s='i love java'
print(s.replace('java','python'))

i love python

In [8]:
first_name='ram'
last_name='ghimire'
print(first_name ,' ' + last_name) # join or concatenate

ram  ghimire

In [9]:
dates='2022-01-05'
dates_split=dates.split('-')
dates_split #gives output in list form

['2022', '01', '05']

## Creating a new data frame

In [10]:
tid=[1,2,3,4,5]
dates=['2022-01-05','2021-04-15','2020-12-05','2016-10-08','2018-07-29']
unit_price=[10,20,100,100,10000]
quantity=[12,10,100,34,20]
full_name=['ram ghimire','gopal poudel', 'hari pandey','suraj karki', 'anil giri']
dicts={'transition_id':tid,'date':dates,'unitprice':unit_price,'quantity':quantity,'full_name':full_name}
dicts

{'transition_id': [1, 2, 3, 4, 5],
 'date': ['2022-01-05',
  '2021-04-15',
  '2020-12-05',
  '2016-10-08',
  '2018-07-29'],
 'unitprice': [10, 20, 100, 100, 10000],
 'quantity': [12, 10, 100, 34, 20],
 'full_name': ['ram ghimire',
  'gopal poudel',
  'hari pandey',
  'suraj karki',
  'anil giri']}

In [11]:
df=pd.DataFrame(dicts)
df

   transition_id        date  unitprice  quantity     full_name
0              1  2022-01-05         10        12   ram ghimire
1              2  2021-04-15         20        10  gopal poudel
2              3  2020-12-05        100       100   hari pandey
3              4  2016-10-08        100        34   suraj karki
4              5  2018-07-29      10000        20     anil giri

## Now lets split full name into two columns i.e, first_name and last_name

In [12]:
df['full_name'].str

In [13]:
df['full_name']

0     ram ghimire
1    gopal poudel
2     hari pandey
3     suraj karki
4       anil giri
Name: full_name, dtype: object

In [14]:
df['full_name'].str.split(' ')

0     [ram, ghimire]
1    [gopal, poudel]
2     [hari, pandey]
3     [suraj, karki]
4       [anil, giri]
Name: full_name, dtype: object

In [15]:
df['full_name'].str.split(' ').str.get(0) #gives only first name

0      ram
1    gopal
2     hari
3    suraj
4     anil
Name: full_name, dtype: object

## Creating a new column now named as first_name

In [16]:
df['first_name']=df['full_name'].str.split(' ').str.get(0)
df

   transition_id        date  unitprice  quantity     full_name first_name
0              1  2022-01-05         10        12   ram ghimire        ram
1              2  2021-04-15         20        10  gopal poudel      gopal
2              3  2020-12-05        100       100   hari pandey       hari
3              4  2016-10-08        100        34   suraj karki      suraj
4              5  2018-07-29      10000        20     anil giri       anil

In [17]:
df['last_name']=df['full_name'].str.split(' ').str.get(1)
df

,transition_id,date,unitprice,quantity,full_name,first_name,last_name
0,1,2022-01-05,10,12,ram ghimire,ram,ghimire
1,2,2021-04-15,20,10,gopal poudel,gopal,poudel
2,3,2020-12-05,100,100,hari pandey,hari,pandey
3,4,2016-10-08,100,34,suraj karki,suraj,karki
4,5,2018-07-29,10000,20,anil giri,anil,giri

* ### Add the new columns and calculate the price

In [18]:
df

,transition_id,date,unitprice,quantity,full_name,first_name,last_name
0,1,2022-01-05,10,12,ram ghimire,ram,ghimire
1,2,2021-04-15,20,10,gopal poudel,gopal,poudel
2,3,2020-12-05,100,100,hari pandey,hari,pandey
3,4,2016-10-08,100,34,suraj karki,suraj,karki
4,5,2018-07-29,10000,20,anil giri,anil,giri

In [19]:
df['unitprice'] # note:total price= unitprice * quantity

0       10
1       20
2      100
3      100
4    10000
Name: unitprice, dtype: int64

In [20]:
df['total_price']=df['unitprice']*df['quantity']
df

,transition_id,date,unitprice,quantity,full_name,first_name,last_name,total_price
0,1,2022-01-05,10,12,ram ghimire,ram,ghimire,120
1,2,2021-04-15,20,10,gopal poudel,gopal,poudel,200
2,3,2020-12-05,100,100,hari pandey,hari,pandey,10000
3,4,2016-10-08,100,34,suraj karki,suraj,karki,3400
4,5,2018-07-29,10000,20,anil giri,anil,giri,200000

## Arrange the columns.

In [21]:
df=df[['transition_id','full_name','first_name','last_name','date','unitprice','quantity','total_price']]
df

,transition_id,full_name,first_name,last_name,date,unitprice,quantity,total_price
0,1,ram ghimire,ram,ghimire,2022-01-05,10,12,120
1,2,gopal poudel,gopal,poudel,2021-04-15,20,10,200
2,3,hari pandey,hari,pandey,2020-12-05,100,100,10000
3,4,suraj karki,suraj,karki,2016-10-08,100,34,3400
4,5,anil giri,anil,giri,2018-07-29,10000,20,200000

## Task:now sepetare date in string into year,month and date.

In [22]:
df['date']

0    2022-01-05
1    2021-04-15
2    2020-12-05
3    2016-10-08
4    2018-07-29
Name: date, dtype: object

In [23]:
df['date'].str.split('-').str.get(0)

0    2022
1    2021
2    2020
3    2016
4    2018
Name: date, dtype: object

In [24]:
df['year']=df['date'].str.split('-').str.get(0)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_14028\1003883276.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['year']=df['date'].str.split('-').str.get(0)

,transition_id,full_name,first_name,last_name,date,unitprice,quantity,total_price,year
0,1,ram ghimire,ram,ghimire,2022-01-05,10,12,120,2022
1,2,gopal poudel,gopal,poudel,2021-04-15,20,10,200,2021
2,3,hari pandey,hari,pandey,2020-12-05,100,100,10000,2020
3,4,suraj karki,suraj,karki,2016-10-08,100,34,3400,2016
4,5,anil giri,anil,giri,2018-07-29,10000,20,200000,2018

In [25]:
df['month']=df['date'].str.split('-').str.get(1)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_14028\4263006958.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['month']=df['date'].str.split('-').str.get(1)

,transition_id,full_name,first_name,last_name,date,unitprice,quantity,total_price,year,month
0,1,ram ghimire,ram,ghimire,2022-01-05,10,12,120,2022,01
1,2,gopal poudel,gopal,poudel,2021-04-15,20,10,200,2021,04
2,3,hari pandey,hari,pandey,2020-12-05,100,100,10000,2020,12
3,4,suraj karki,suraj,karki,2016-10-08,100,34,3400,2016,10
4,5,anil giri,anil,giri,2018-07-29,10000,20,200000,2018,07

In [26]:
df['day']=df['date'].str.split('-').str.get(2)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_14028\3163622425.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['day']=df['date'].str.split('-').str.get(2)

,transition_id,full_name,first_name,last_name,date,unitprice,quantity,total_price,year,month,day
0,1,ram ghimire,ram,ghimire,2022-01-05,10,12,120,2022,01,05
1,2,gopal poudel,gopal,poudel,2021-04-15,20,10,200,2021,04,15
2,3,hari pandey,hari,pandey,2020-12-05,100,100,10000,2020,12,05
3,4,suraj karki,suraj,karki,2016-10-08,100,34,3400,2016,10,08
4,5,anil giri,anil,giri,2018-07-29,10000,20,200000,2018,07,29

In [27]:
df.to_csv('processed_data.csv', index=False)

## The above date is given in string(object)datatype so Converting into datetime datatype  columns.

In [28]:
df1 = df[['transition_id','full_name','first_name','last_name','date','unitprice','quantity','total_price']]
df1

,transition_id,full_name,first_name,last_name,date,unitprice,quantity,total_price
0,1,ram ghimire,ram,ghimire,2022-01-05,10,12,120
1,2,gopal poudel,gopal,poudel,2021-04-15,20,10,200
2,3,hari pandey,hari,pandey,2020-12-05,100,100,10000
3,4,suraj karki,suraj,karki,2016-10-08,100,34,3400
4,5,anil giri,anil,giri,2018-07-29,10000,20,200000

In [29]:
df['date']
pd.to_datetime(df['date'])
df['date']==pd.to_datetime(df['date'])

0    True
1    True
2    True
3    True
4    True
Name: date, dtype: bool

### Different attributes in datetime

In [30]:
df['date'].dt.year

AttributeError: Can only use .dt accessor with datetimelike values

In [ ]:
df['year']=df['date'].dt.year
df

In [ ]:
df

In [ ]:
df['date'] = df['date'].astype(str)

In [ ]:
df1['date']

In [ ]:
pd.to_datetime(df1['date'])

In [ ]:
df1['date']=pd.to_datetime(df1['date'])

### Different attributes in datetime

In [ ]:
df1['date'].dt.year

In [ ]:
df1['year']=df1['date'].dt.year

In [ ]:
df1

In [ ]:
df1['date'].dt.month
df1['month_numeric']=df1['date'].dt.month

In [ ]:
df1

In [ ]:
df1['date'].dt.month_name()
df1['month_name']=df1['date'].dt.month_name()

In [ ]:
df1

In [ ]:
df1['date'].dt.day

In [ ]:
df1['day_numeric']=df1['date'].dt.day
df1

In [ ]:
df1['day_name']=df1['date'].dt.day_name()
df1

### 12 month=[3 quatar] 1st quatar=jan,feb,march

In [ ]:
df1['date'].dt.quarter

## string functions

In [ ]:
df['first_name'].str.upper() #str should aways be written

In [ ]:
df['first_name'].str.replace('ram','shyam').str.upper()

## fetch the row which starts with name s.

In [ ]:
'hello'.startswith('i')

In [ ]:
df['first_name'].str.startswith('s')

In [ ]:
df[df['first_name'].str.startswith('s')]